GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/gps.c
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
		GPIO_Init( GPIOB, &GPIO_InitStructure );
	}

/*uart5 管脚设置*/

	GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_12;
	GPIO_Init( GPIOC, &GPIO_InitStructure );

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init( GPIOD, &GPIO_InitStructure );

	GPIO_PinAFConfig( GPIOC, GPIO_PinSource12, GPIO_AF_UART5 );
	GPIO_PinAFConfig( GPIOD, GPIO_PinSource2, GPIO_AF_UART5 );

/*NVIC 设置*/
	NVIC_InitStructure.NVIC_IRQChannel						= UART5_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority	= 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority			= 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd					= ENABLE;
	NVIC_Init( &NVIC_InitStructure );

	gps_baud( 9600 );
	USART_Cmd( UART5, ENABLE );
	USART_ITConfig( UART5, USART_IT_RXNE, ENABLE );

	GPIO_SetBits( GPS_PWR_PORT, GPS_PWR_PIN );

	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_open( rt_device_t dev, rt_uint16_t oflag )
{
	GPIO_SetBits( GPS_PWR_PORT, GPS_PWR_PIN );
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_close( rt_device_t dev )
{
	GPIO_ResetBits( GPS_PWR_PORT, GPS_PWR_PIN );
	return RT_EOK;
}

/***********************************************************
* Function:gps_read
* Description:数据模式下读取数据
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_size_t dev_gps_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/* write one character to serial, must not trigger interrupt */
static void uart5_putc( const char c )
{
	USART_SendData( UART5, c );
	while( !( UART5->SR & USART_FLAG_TXE ) )
	{
		;
	}
	UART5->DR = ( c & 0x1FF );
}

/***********************************************************
* Function:		gps_write
* Description:	数据模式下发送数据，要对数据进行封装
* Input:		const void* buff	要发送的原始数据
       rt_size_t count	要发送数据的长度
       rt_off_t pos		使用的socket编号
* Output:
* Return:
* Others:
***********************************************************/

static rt_size_t dev_gps_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;

	while( len )
	{
		USART_SendData( UART5, *p++ );
		while( USART_GetFlagStatus( UART5, USART_FLAG_TC ) == RESET )
		{
		}
		len--;
	}
	return RT_EOK;
}

/***********************************************************
* Function:		gps_control
* Description:	控制模块
* Input:		rt_uint8_t cmd	命令类型
    void *arg       参数,依据cmd的不同，传递的数据格式不同
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gps_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	int i = *(int*)arg;
	switch( cmd )
	{
		case CTL_GPS_OUTMODE:
			break;
		case CTL_GPS_BAUD:
			gps_baud( i );
	}
	return RT_EOK;
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gps_stack[1024];
struct rt_thread thread_gps;


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gps( void* parameter )
{
	rt_err_t	res;
	LENGTH_BUF	buf;
	uint8_t		count_check_antenna = 0;
	rt_tick_t	tick_lastrx			= rt_tick_get( );

	while( 1 )
	{
		res = rt_mq_recv( &mq_gps, (void*)&buf, NEMA_SIZE, RT_TICK_PER_SECOND / 20 );   //等待100ms,实际上就是变长的延时,最长100ms
		if( res == RT_EOK )                                                             //收到一包数据
		{
			tick_lastrx = rt_tick_get( );
			jt808_alarm &= ~BIT_ALARM_GPS_ERR;
			if( flag_bd_upgrade_uart == 0 )
			{
				gps_rx( buf.body, buf.wr );
			}else
			{
				if( buf.body[0] == 0x40 )
				{
					rt_device_write( &dev_vuart, 0, buf.body, buf.wr );
				}
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );	/*为了保证可靠的挂起线程*/
		if( ( rt_tick_get( ) - tick_lastrx ) > RT_TICK_PER_SECOND * 10 )    /*长时间没有语句输出,模块损坏*/
		{
			rt_kprintf( "%d>gps no output\r\n", rt_tick_get( ) );
			jt808_alarm |= BIT_ALARM_GPS_ERR;
			GPIO_ResetBits( GPIOD, GPIO_Pin_10 );                           /*off gps*/
			while( rt_mq_recv( &mq_gps, (void*)&buf, NEMA_SIZE, RT_TICK_PER_SECOND / 20 ) == RT_EOK )
			{
				rt_thread_delay( RT_TICK_PER_SECOND / 20 );
			}
			rt_thread_delay( RT_TICK_PER_SECOND * 3 );
			GPIO_SetBits( GPIOD, GPIO_Pin_10 );                             /*on gps*/
			tick_lastrx = rt_tick_get( );
		}
		if( gps_notfixed_count > 10 * 60 )                                  /*15分钟未定位*/
		{
			rt_kprintf( "\n10分钟未定位" );
			beep( 5, 5, 5 );
			GPIO_ResetBits( GPIOD, GPIO_Pin_10 );                           /*off gps*/
			while( rt_mq_recv( &mq_gps, (void*)&buf, NEMA_SIZE, RT_TICK_PER_SECOND / 20 ) == RT_EOK )
			{
				rt_thread_delay( RT_TICK_PER_SECOND / 20 );
			}
			rt_thread_delay( RT_TICK_PER_SECOND * 3 );
			GPIO_SetBits( GPIOD, GPIO_Pin_10 );                             /*on gps*/
			gps_notfixed_count = 0;
		}
		if( jt808_param.id_0xF013 == 0x3020 )
		{
			count_check_antenna++;
			if( count_check_antenna == 40 )
			{
				count_check_antenna = 0;
				// 2013-4-20	更改PCB   用PD4 : GPS 天线开路		PB6 : GPS  天线短路
				if( GPIO_ReadOutputDataBit( GPS_PWR_PORT, GPS_PWR_PIN ) )   // 在GPS 有电时有效
				{
					GPIO_ResetBits( GPIOD, GPIO_Pin_4 );
					if( GPIO_ReadInputDataBit( GPIOD, GPIO_Pin_4 ) )        //开路检测	1:天线开路
					{
						//if((jt808_status&BIT_ALARM_GPS_OPEN)==0)
						{
							rt_kprintf( "\n开路了" );
						}
						jt808_alarm |= BIT_ALARM_GPS_OPEN;
					}else
					{
						jt808_alarm &= ~BIT_ALARM_GPS_OPEN;
					}

