GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/gps.c
#if 0
	GPIO_ResetBits( GPIOD, GPIO_Pin_10 );   /*off gps*/
	rt_thread_delay( RT_TICK_PER_SECOND * 2 );
	GPIO_SetBits( GPIOD, GPIO_Pin_10 );     /*on gps*/
	rt_thread_delay( RT_TICK_PER_SECOND * 2 );
#endif

/*进入升级状态*/
	memcpy( buf, "\x40\x30\xC0\x00\x03\x00\x01\x34\x21\x0D\x0A", 11 );
	dev_gps_write( &dev_gps, 0, buf, 11 );
	rt_thread_delay( RT_TICK_PER_SECOND * 2 );
/*版本查询*/
	count = 0;

/*先清除已有的数据，再发送*/
	while( rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, 0 ) == RT_EOK )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	}

	dev_gps_write( &dev_gps, 0, "\x40\x10\xC0\x00\x10\x00\x01\xC2\x84\x0D\x0A", 11 );
	res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 5 );
	if( res == RT_EOK )                                             //收到一包数据
	{
		if( ( uart_buf.wr == 15 ) && ( uart_buf.body[4] == 0x02 ) ) /*进入升级状态*/
		{
			ch_h	= ( uart_buf.body[7] & 0xf0 ) >> 4;
			ch_l	= ( uart_buf.body[7] & 0xf );
			sprintf( buf, "I模块版本:%d.%d.%d", ch_h, ch_l, uart_buf.body[8] );
			msg( buf );
		}
	}else /*超时*/
	{
		msg( "E进入升级错误" );
		goto end_upgrade_usb_2;
	}

/*改波特率*/
	dev_gps_write( &dev_gps, 0, "\x40\x41\xC0\x00\x00\x00\xE1\x00\x00\x04\x07\xFC\x0D\x0A", 14 );
	gps_baud( 57600 );
	rt_thread_delay( RT_TICK_PER_SECOND );
/*连接查询*/
	dev_gps_write( &dev_gps, 0, "\x40\x15\xC0\x00\x01\x00\x01\x92\xD4\x0D\x0A", 11 );
	while( 1 )
	{
		res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 5 );
		if( res == RT_EOK ) //收到一包数据
		{
			if( ( uart_buf.wr == 11 ) && ( uart_buf.body[4] == 0x15 ) )
			{
				break;
			}
		}else /*超时*/
		{
			msg( "E修改波特率错误" );
			goto end_upgrade_usb_2;
		}
	}

/*开始烧写,烧写指令*/
	memcpy( buf, "\x40\xF2\xC0\x00\x03\x00\x00\x00\x00\x00\x00\x00\x00\x08\x00\x00\x0D\x0A", 18 );
	buf[6]	= file_datalen >> 24;
	buf[7]	= file_datalen >> 16;
	buf[8]	= file_datalen >> 8;
	buf[9]	= file_datalen & 0xff;
	buf[10] = file_matchcode[0];
	buf[11] = file_matchcode[1];

	crc		= CalcCRC16( buf, 1, 13, 0 );
	buf[14] = ( crc & 0xff00 ) >> 8;
	buf[15] = crc & 0xff;

	dev_gps_write( &dev_gps, 0, buf, 18 );

	ch_l = 1;
	while( ch_l )
	{
		res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 10 );
		if( res == RT_EOK ) //收到一包数据
		{
			if( ( uart_buf.wr == 11 ) && ( uart_buf.body[4] == 0xf2 ) )
			{
				ch_l = 0;
			}
		}else /*超时*/
		{
			msg( "E开始升级错误" );
			goto end_upgrade_usb_2;
		}
	}

/*发送数据包*/
	count		= 0;        /*计算发送字节数*/
	packet_num	= 0;
	read( fd, buf, 15 );    /*跳过文件头*/
//	rt_kprintf( "fd=%02x\r\n", fd );
	while( 1 )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 2 );
		memcpy( ptr_mem_packet, "\x40\xf2\x00\x00\x03\x01", 6 );
		res = read( fd, ptr_mem_packet + 6, READ_PACKET_SIZE );
		if( res < 0 )
		{
			msg( "E读取文件出错" );
			goto end_upgrade_usb_2;
		}

		count += res;
		if( res == READ_PACKET_SIZE )           /*判断是否为最后一包*/
		{
			if( count == file_datalen )         /*长度正为1012整数倍*/
			{
				ptr_mem_packet[2]	= 0x80 | ( packet_num >> 8 );
				ptr_mem_packet[3]	= packet_num & 0xff;
				res					= res - 6;
			}else
			{
				if( count == READ_PACKET_SIZE ) /*第一包*/
				{
					ptr_mem_packet[2]	= 0x40 | ( packet_num >> 8 );
					ptr_mem_packet[3]	= packet_num & 0xff;
				}else
				{
					ptr_mem_packet[2]	= packet_num >> 8;
					ptr_mem_packet[3]	= packet_num & 0xff;
				}
			}
		}else
		{
			ptr_mem_packet[2]	= 0x80 | ( packet_num >> 8 );
			ptr_mem_packet[3]	= packet_num & 0xff;
			/*去掉文件尾部的数据*/
			res = res - 6;
		}
		packet_num++;
		ptr_mem_packet[res + 6]		= ( res + 2 ) >> 8;
		ptr_mem_packet[res + 7]		= ( res + 2 ) & 0xff;
		crc							= CalcCRC16( ptr_mem_packet, 1, res + 7, 0 );
		ptr_mem_packet[res + 8]		= ( crc & 0xff00 ) >> 8;
		ptr_mem_packet[res + 9]		= crc & 0xff;
		ptr_mem_packet[res + 10]	= 0x0d;
		ptr_mem_packet[res + 11]	= 0x0a;

		dev_gps_write( &dev_gps, 0, ptr_mem_packet, res + 12 );

		ch_l = 1;
		while( ch_l )
		{
			res = rt_mq_recv( &mq_gps, (void*)&uart_buf, NEMA_SIZE, RT_TICK_PER_SECOND * 12 );
			if( res == RT_EOK ) //收到一包数据
			{
				if( uart_buf.wr == 11 )
				{
					if( uart_buf.body[4] == 0x02 )
					{
						//dev_gps_write( &dev_gps, 0, "\x40\x34\xC0\x00\x34\x00\x01\x84\x6B\x0D\x0A", 11 );
						dev_gps_write( &dev_gps, 0, cmd_reset, 11 );
						msg( "E升级完成" );
						rt_kprintf( "\n升级完成" );
						goto end_upgrade_usb_2;
					}
					sprintf( buf, "I发送第%d包", packet_num );
					rt_kprintf( "%d", packet_num % 10 );
					msg( buf );
					ch_l = 0;
				}
			}else /*超时*/
			{
				msg( "E升级错误" );
				goto end_upgrade_usb_2;
			}
		}
	}

end_upgrade_usb_2:
	if( fd >= 0 )
	{
		close( fd );
	}
end_upgrade_usb_0:
	rt_free( ptr_mem_packet );
	ptr_mem_packet = RT_NULL;
	rt_thread_delay( RT_TICK_PER_SECOND * 3 );
	//GPIO_ResetBits( GPIOD, GPIO_Pin_10 );
	gps_baud( 9600 );
	while( rt_thread_resume( &thread_gps ) != RT_EOK )
	{
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
	rt_kprintf( "\nbd>resume gps ok" );

	rt_thread_delay( RT_TICK_PER_SECOND * 1 );
	//GPIO_SetBits( GPIOD, GPIO_Pin_10 );
}

/*gps升级*/
rt_err_t gps_upgrade( void )
{
	rt_thread_t tid;
	tid = rt_thread_create( "upgrade", thread_gps_upgrade_udisk, (void*)msg_uart_usb, 1024, 5, 5 );
	if( tid != RT_NULL )
	{
		rt_thread_startup( tid );
	}else
	{
		rt_kprintf( "\n Upgrade from usb fail\n" );
	}
}

FINSH_FUNCTION_EXPORT( gps_upgrade, upgrade bd_gps );

static char *reset_str[] = {
	"$CCSIR,1,0*49\r\n",    /*热启动 BD*/
	"$CCSIR,2,0*4A\r\n",    /*热启动 GPS*/
	"$CCSIR,3,0*4B\r\n",    /*热启动 GN*/
	"$CCSIR,1,1*48\r\n",    /*冷启动 BD*/
	"$CCSIR,2,1*4B\r\n",    /*冷启动 GP*/
	"$CCSIR,3,1*4A\r\n",    /*冷启动 GN*/
};

/**/
rt_size_t gps_mode( uint8_t mode )
{
	dev_gps_write( &dev_gps, 0, reset_str[mode - 1], 15 ); switch( mode )
	{
		case 0:
			break;
		case 1: /*BD*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,1,0*49\r\n", 15 );
			break;
		case 2: /*GPS*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,2,0*4A\r\n", 15 );
			break;
		case 3: /*BDGPS*/
			dev_gps_write( &dev_gps, 0, "$CCSIR,3,0*4B\r\n", 15 );
			break;
	}
}

FINSH_FUNCTION_EXPORT( gps_mode, change mode );

/**/
rt_size_t gps_reset( uint8_t start_mode )
{
	dev_gps_write( &dev_gps, 0, reset_str[start_mode * 3 + gps_status.mode - 1], 15 );
}



void gps_write( char* s)
{
	dev_gps_write( &dev_gps, 0, s, strlen(s) );
}
FINSH_FUNCTION_EXPORT( gps_write, write to gps );


/************************************** The End Of File **************************************/
